[M_Orchid_PlotMission05 MissionDefinition]
MissionDescription="Scarlett knows the last part of Captain Blade's compass. Herbert, your former employee who lives abroad, is talking to you. [place]The comfort bit.[-place], There is a lot to know about sand jewelry. If you find it, it can lead you to the last part of the park.."
TurnInDescription="When you meet Herbert, he will take you to the end of the Captain's Knife Compass. however."

[M_Orchid_PlotMission05:GetBoxSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scarlett knows the last part of Captain Blade's compass. Herbert, your former employee who lives abroad, is talking to you. [place]The comfort bit.[-place], There is a lot to know about sand jewelry. If you find it, it can lead you to the last part of the park.. Scarlett has asked you to deliver a special gift to Herbert."
